const config = {
	name: "صراحة",
	aliases: ["أسئلني", "صراحه"],
	description: "أسئلة عشوائية يطرحها لك البوت، أجب عليها بكل صراحة. ",
	usage: " ",
	cooldown: 3,
	permissions: [0, 1, 2],
	credits: "DiyaKD",

}

export const DATA = ["◆ ماذا ستقول لو صمت العالم دقيقة واحدة لسماعك؟ "
	,
	"◆ شخصية تاريخية تتمنى لو قابلتها؟ ",
	"◆ لو عدت بالزمن للوراء.. ما الخطأ الذي لن تعيد إرتكابه؟ ",
	"◆ القهوة أم الشاي تفضل؟",
	"◆ شخصية أنمي تستطيع أن تقلد صوتها؟ ",
	"◆ لو سألتك من أنت؟.. كيف ستجيب؟ ",
	"◆ شخصية أنمي تود لقاءها لو كانت حقيقية؟ ",
	"◆ هل تعتقد أن التكنولوجيا صديق أم عدو لنا حالياً؟ ",
	"◆ هل أكملت أداء كل صلواتك المفروضة اليوم؟ ",
	"◆ ماذا يمكنك أن تقدم لمجتمعنا الإسلامي كي ينهض و يتقدم؟ ",
	"◆ ما هو نمط شخصيتك؟ ",
	"◆ إذا كان لديك مذكرة الموت.. أكتب أسماء 5 أشخاص تريد موتهم بعد قليل؟ ",
	"◆ هل أنت مستعد لمسامحة كل من أخطأ في حقك مقابل أن يعفو عنك كل من أخطأت أنت في حقهم يوم القيامة؟ ",
	"أ◆ أنمي قمت بغسل عينيك بالماء و الصابون ندماً على مشاهدتك له؟ ",
	"◆ آخر مرة بكيت فيها مع ذكر السبب. ",
	"◆ أنت بكامل ما أنعم الله عليك من نعمة الجسد أو الصحة أو الحالة المادية، إذاً لما أنت حزين؟ ",
	"◆ هل أنت سعيد بما لديك الآن؟ ",
	"◆ هل لديك أي خطة لحياتك المستقبلية و ما تبقى لها حالياً؟ ",
	"◆ أذكر 5 مواصفات تريدها في شريك حياتك: ",
	"◆ لديك مبلغ مليار دولار كيف ستنفقه؟ ",
	"◆ كم لديك من المال في جيبك الآن؟",
	"◆ كيف تحقق الإستفادة القصوى من مواقع التواصل الإجتماعي حالياً؟ ",
	"◆ مواصفات بيت أحلامك: ",
	"◆ كيف تتقرب من شخص تحبه؟",
	"◆ أكثر 5 أشياء تخيفك هي: ",
	"◆ آية قرآنية قرأتها و أثرت فيك كثيراً  مع ذكر السبب"]

async function onCall({ message }) {
	message.reply(DATA[Math.floor(Math.random() * DATA.length)])
}

export default {
	config,
	onCall
}