const config = {
	name: "تحدي",
	description: "صراحة أم تحدي..  نفذ التحدي بكل ما أوتيت من شجاعة إن لم تفعل فأنت جبان! ",
	usage: " ",
	cooldown: 3,
	permissions: [0, 1, 2],
	credits: "DiyaKD",

}

export const DATA = ["◇ تحدي..  أتحداك ترسل رسالة صوتية تقول في 'اوني تشان' لو لم تنفذ التحدي فسيكون اسمك في المجموعة جبان(ة)   تشان",
	"◇ إليك تحدي..  أتحداك ترسل ريكورد تقول فيه نشيد 'أنا الفتاة المسلمة!''",
	"◇ تحدي 🔥..   أتحداك تصور نخرتك 👃 و تجدعها في القروب و تحذفها إلا بعد مرور 3 دقايق.. ⭕إذا ما نفذت التحدي، إسمك في القروب حيكون (أب نخرة 👃)، يلا قش نخامتك و أبدا التحدي 🐸🤝",
	"◇ تحدي.. 🔥  أتحداك ترسل سلفي العيد الفات في القروب دا.    ⭕ إذا ما نفذت التحدي فسيكون اسمك في المجموعة  (خروف العيد 🐏)",
	"◇ قول في ريكورد الكلام دا: (انا حمار انا خروف  المهم انا حيوان)و لو مجاني أنشره في بوست ر ما تحذفه إلا بهد 5 دقايق.   ⭕ إذا ما نفذت التحدي.. فكنيتك في القروب حتكون نفس الطلبت منك تقوله. ",
	"◇ أتحداك.. تلغي حظر كل الحظرتهم الآن و تبدو بداية جديدة 🔥",
	"◇ أتحداك.. ترسل/ي رسالة للكراش مليانة غزل و ترسل سكرين شوت للرسالة في القروب بدون ما تخفي اسمه.     ⭕ إذا ما نفذت التحدي فأعضاء المجموعة بختارو ليك اسم. 🐸🤝",
	"◇ تحدي نار 🔥.. أتحداك تلبس أقرب حاجة جنبك نظام طرحةو تجدع الصورة في القروب و تحذفها إلا بعد مرور 50ث (الزمن دا بكون كرامتك اتمسحت 🐸)،   ⭕ إذا ما نفذت التحدي فسيكون اسمك في المجموعة (ابو طرحة.. التحدي اولاد فقط. )",
	"◇ أتحداك.. ترسل كلمة السر حقتك و ما تمسح/ي منها غير حرفين 2.. ألحق غيرها قبل الهكر الهنا يشركو ليك 🐸🤝",
	"◇ أتحداك تضرب أقرب شخص جنبك.. ",
	"◇ أتحداك.. تتحدى صاحب الرسالة الفوق دا 🙂☝ أنه يختار ليك تحدي لو نفذتو انت تختار ليه تحدي هو ينفذه كمان 🐸...  ⭕ لو ما نفذت التحدي دا اسمك في القروب حيكون (أرهن رهينة 🐸)"
]

async function onCall({ message }) {
	message.reply(DATA[Math.floor(Math.random() * DATA.length)])
}

export default {
	config,
	onCall
}