const config = {
  name: "نكتة",
  description: "يقوم بإرسال نكتة عشوائية",
  usage: " ",
  cooldown: 3,
  permissions: [0, 1, 2],
  credits: "Diyakd",

}

export const DATA = [
  "في تفاحة 🍎 عطشانة قالت دايرة موية apple ريقي 😂😂😂😂😂",
  "واحد وقف ف خشم الباب قام الباب عضاو 🤣🤣🤣",
  "استادة رياضيات عملت حادثقال ليه عندك كسور قالت ليهم وحدو المقامات",
  "شافع رباطابي سال حبوبتو قال ليها : انت يا حبوبة عمرك كم؟ \nقالت ليهو 100 \nقال ليها خلاص ما تفصلي الشاحن بعد دا 🤣🤣",


  "دكتور أسنان قالو ليهو داير تعرس متين قال ليهم لثه😂😂😂",

  "سمكة جات تنوم قالو ليها تسبحين على خير 😂😂😂🐸",
  "واحد كرعينه خضرت ودوها المشتل 😂😂😂",
  "مره واحد بيعاكس واحده عندها حسنه فوق عينيها بيقولها عين دي ولا غين",
  "رباطابي جايي من الجزارة شايل كوارع.... في واحد شافه حب يتظارف شوية قال ليهو يا حاج انت الليله عازم كلاب ولا شنو . عمك قال ليهو اي الكرت ما جاك؟ 😆🤣🤣",

  "مسطول سأل واحده من اسمها قالت ليه يارا ياسين وانت منو؟...قال ليها :يا ميم يا واو 😂😂",
  "كمساري مات 🥹.. دفنوه في آخر محطة 😂😂😂😂😂",
  "أستاذ رياضيات فلس.. سرق من جيب الزاوية 🐸💔",
  "واحدة شينة شناة مبالغة عرسوها لود عمها و هي ما دايراه عاينت لنفسها في المراية و قالت يستاهل 🐸😂😂😂",
  "واحد عمل شاي خفيف الهواء شالو 🐸😂",
  "رباطابي بيعطس وبيكح مرتو سالتو مالك عيان؟ \nقال ليها: لالا بختار لي في نغمة🐸😂😂",
  "واحد عنده زهايمر.. ضحك خلا خشمه فاتح🐸💔",
  "أستاذ عربي وقع رفعوُ بالضمة 😂😂😂💔"
]

async function onCall({ message }) {
  message.reply(DATA[Math.floor(Math.random() * DATA.length)])
}

export default {
  config,
  onCall
}